{
  "mainTitle": "OnyxGold - магазин за златни бижута",
  "mainInfo": "OnyxGold е специално място в интернет пространство, където ще срещнете изобилие от така актуалните днес сребърни бижута. По-важното е, че ще попаднете на изделия с уникален дизайн, създаден специално от нас за взискателните купувачи, за които е важно да се отличат от масата – да бъдат уникални. Приветстваме ви с добре дошли в нашия електронен магазин. Уверени сме, че ще отговорим на високите ви очаквания.",
  "info": [
    { "title": "С какво сме различни от всички останали?" },
    {
      "paragraph": "Накитите не са променили своето предназначение от древността до днес, но дизайнът и визията им значително са се променили. В тази област, също както в повечето сфери на живота, властват модните течения, а те са известни със своята краткотрайност. Нещо съвсем модно днес, утре е демоде – твърде тъжно за един толкова стойностен продукт, какъвто е бижуто."
    },
    {
      "paragraph": "Сребърните и златните бижута със скъпоценни и полускъпоценни камъни са непреходни. Тяхната актуалност е важна единствено, когато са масово производство. Ние намерихме успешно решение на проблема с преходността на накитите – създаваме ги различни от всички останали, без да се влияем от модата. Всъщност, ние я диктуваме."
    },
    {
      "paragraph": "Всяко изделие се изработва ръчно от майсторите ни ювелири. Сам по себе си този факт доказва неговата уникалност. Продуктите пристигат при вас, придружени от сертификат за оригинален произход и качество. Когато планирате да подарите накит на специален човек, обезателно се уврете, че е изработен съобразно всички законови изисквания, касаещи производството и търговия с благородни метали и изделия, направени от такъв материал."
    },
    { "title": "Всяко изделие се изработва ръчно" },
    {
      "paragraph": "Всяко изделие се изработва ръчно от майсторите ни ювелири. Сам111 по себе си този факт доказва неговата уникалност. Продуктите пристигат при вас, придружени от сертификат за оригинален произход и качество. Когато планирате да подарите накит на специален човек, обезателно се уврете, че е изработен съобразно всички законови изисквания, касаещи производството и търговия с благородни метали и изделия, направени от такъв материал."
    }
  ]
}
