import { useRef, useState } from "react";
import "./shopInfo.scss";
import styled from "@emotion/styled";

export const ShopInfo = () => {
  const [collapsed, isCollapsed] = useState(true);

  const ref = useRef<HTMLDivElement>(null);

  const toggleIsCollapsed = () => {
    isCollapsed((curr) => !curr);
  };

  return (
    <ShopInfoStyled
      onClick={toggleIsCollapsed}
      collapsed={collapsed}
      offsetHeight={ref.current?.offsetHeight}
      className="shopInfo"
    >
      <div ref={ref}>
        <h1 className="shopInfo__title">OnyxGold - магазин за златни бижута </h1>
        <p>
          OnyxGold е специално място в интернет пространство, където ще срещнете изобилие от така актуалните днес
          сребърни бижута. По-важното е, че ще попаднете на изделия с уникален дизайн, създаден специално от нас за
          взискателните купувачи, за които е важно да се отличат от масата – да бъдат уникални. Приветстваме ви с добре
          дошли в нашия електронен магазин. Уверени сме, че ще отговорим на високите ви очаквания.
        </p>
        <h2>С какво сме различни от всички останали?</h2>
        <p>
          Накитите не са променили своето предназначение от древността до днес, но дизайнът и визията им значително са
          се променили. В тази област, също както в повечето сфери на живота, властват модните течения, а те са известни
          със своята краткотрайност. Нещо съвсем модно днес, утре е демоде – твърде тъжно за един толкова стойностен
          продукт, какъвто е бижуто.
        </p>
        <p>
          Сребърните и златните бижута със скъпоценни и полускъпоценни камъни са непреходни. Тяхната актуалност е важна
          единствено, когато са масово производство. Ние намерихме успешно решение на проблема с преходността на
          накитите – създаваме ги различни от всички останали, без да се влияем от модата. Всъщност, ние я диктуваме.
        </p>
        <p>
          Всяко изделие се изработва ръчно от майсторите ни ювелири. Сам по себе си този факт доказва неговата
          уникалност. Продуктите пристигат при вас, придружени от сертификат за оригинален произход и качество. Когато
          планирате да подарите накит на специален човек, обезателно се уврете, че е изработен съобразно всички законови
          изисквания, касаещи производството и търговия с благородни метали и изделия, направени от такъв материал.
        </p>
      </div>
    </ShopInfoStyled>
  );
};

const ShopInfoStyled = styled("div")<{ collapsed: boolean; offsetHeight: number | undefined }>(
  ({ collapsed, offsetHeight }) =>
    () => {
      if (collapsed)
        return {
          height: "250px",
          "-webkit-mask-image":
            " -webkit-gradient(linear, center bottom, center top, color-stop(1.00,  rgba(0,0,0,1)), color-stop(0.00,  rgba(0,0,0,0)))",
        };
      else {
        if (offsetHeight) return { height: `${offsetHeight}px` };
        else return {};
      }
    }
);
